DiplomD/src/Documents/Переаттестация/Переаттестация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Переаттестация</name>
  <attributes>
    <name>ЗаявлениеНаПересдачу</name>
    <type>
      <types>DocumentRef.ЗаявленияНаПересдачу</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФормаИтоговогоКонтроля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комиссия</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыЧленовКомиссии</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ЗачетнаяКнижкаСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетнаяКнижкаСтудента</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАттестационныхДисцилин</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перезачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийСеместровыйРейтинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ЗаявленияНаПересдачу/ЗаявленияНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПересдачу</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаГосударственнойИтоговойАттестации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/Кафедры/Кафедры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кафедры</name>
  <attributes>
    <name>НомерКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведующийКафедрой</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМетодист</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПреподавательскийСостав</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПреподавателя</name>
      <type>
        <types>CatalogRef.ДолжностиПреподавательскогоСостава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрофилиНаправления</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ПрофилиНаправления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DiplomD/src/Documents/Переаттестация/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Для каждого стр из Объект.ТЧ Цикл 
	Док = Документы.ЗачетнаяКнижкаСтудента.НайтиПоРеквизиту("Студент",Объект.Студент).ПолучитьОбъект(); 
	парам = Новый Структура; 
	Парам.Вставить("Дисциплина",Стр.Дисциплина); 
	НС = Док.СписокАттестационныхДисцилин.НайтиСтроки(Парам); 
	Для каждого строк из НС цикл 
		
		Строк.Оценка = Стр.Оценка;
		Строк.перезачтено = Истина; 
	КонецЦикла; 
	
		
         Док.Записать(РежимЗаписиДокумента.Запись); 
		 Док.Записать(РежимЗаписиДокумента.Проведение); 
		
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаявлениеНаПересдачуПриИзмененииНаСервере()
	Док = Документы.ЗаявленияНаПересдачу.НайтиПоНомеру(Объект.ЗаявлениеНаПересдачу.Номер); 
	Объект.Студент = Док.Студент; 
	Док2 = Документы.ЗачетнаяКнижкаСтудента.НайтиПоРеквизиту("Студент",Док.Студент); 
	Объект.НомерЗачетнойКнижки = Док2.НомерЗачетнойКнижки; 
	Объект.НаправлениеПодготовки = Док2.ПрофильНаправления; 
	
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	КафедрыПрофилиНаправления.Ссылка.Факультет КАК Факультет
	               |ИЗ
	               |	Справочник.Кафедры.ПрофилиНаправления КАК КафедрыПрофилиНаправления
	               |ГДЕ
	               |	КафедрыПрофилиНаправления.Профиль = &Профиль"; 
	Запрос.УстановитьПараметр("ПРофиль",Док2.ПрофильНаправления); 
	рез = Запрос.Выполнить().Выбрать(); 
	Рез.Следующий(); 
	Объект.Факультет = рез.Факультет; 
	
	Для каждого стр из Док.ТЧ Цикл 
	О = Объект.ТЧ.Добавить(); 
	О.Дисциплина = Стр.Дисциплина; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеНаПересдачуПриИзменении(Элемент)
	ЗаявлениеНаПересдачуПриИзмененииНаСервере();
КонецПроцедуры
